#ifndef OPEN_TYPE_H
#define OPEN_TYPE_H

#include "lsCRT.h"
#include "lsStack.h"
#include "lsMath.h"   //TODO: REMOVE THIS.
#include "lsBitmap.h" //TODO: REMOVE THIS.


//NOTE: Utility Byte Manipulation
#define GetByte(at) *at; at+=1
#define GetByteSwap16(at)  ByteSwap16(*(u16*)at); at+=2
#define GetByteSwapS16(at) ByteSwap16(*(s16*)at); at+=2
#define GetByteSwap32(at)  ByteSwap32(*(u32*)at); at+=4
#define GetByteSwapS32(at) ByteSwap32(*(s32*)at); at+=4
#define GetByteSwap64(at)  ByteSwap64(*(u64*)at); at+=8
#define GetByteSwapS64(at) ByteSwap64(*(s64*)at); at+=8

// 'OTTO' Tag
#define OT_SFNTVERSION_CFFDATA 0x4F54544F
#define OT_SFNTVERSION_OUTLINE 0x00010000

//---------- TAGS -----------//

// Required Tables
#define OT_TAG_CMAP 'cmap'
#define OT_TAG_HEAD 'head'
#define OT_TAG_HHEA 'hhea'
#define OT_TAG_HMTX 'hmtx'
#define OT_TAG_MAXP 'maxp'
#define OT_TAG_NAME 'name'
#define OT_TAG_OS_2 'OS/2'
#define OT_TAG_POST 'post'

//TrueType Outlines
#define OT_TAG_CVT  'cvt '
#define OT_TAG_FPGM 'fpgm'
#define OT_TAG_GLYF 'glyf'
#define OT_TAG_LOCA 'loca'
#define OT_TAG_PREP 'prep'
#define OT_TAG_GASP 'gasp'

//CFF Outlines
#define OT_TAG_CFF  'CFF '
#define OT_TAG_CFF2 'CFF2'
#define OT_TAG_VORG 'VORG'

//SVG Outlines
#define OT_TAG_SVG  'SVG '

//Bitmap Glyphs
#define OT_TAG_EBDT 'EBDT'
#define OT_TAG_EBLC 'EBLC'
#define OT_TAG_EBSC 'EBSC'
#define OT_TAG_CBDT 'CBDT'
#define OT_TAG_CBLC 'CBLC'
#define OT_TAG_SBIX 'sbix'

//Advanced Typograhic Tables
#define OT_TAG_BASE 'BASE'
#define OT_TAG_GDEF 'GDEF'
#define OT_TAG_GPOS 'GPOS'
#define OT_TAG_GSUB 'GSUB'
#define OT_TAG_JSTF 'JSTF'
#define OT_TAG_MATH 'MATH'

//OpenType Font Variations
#define OT_TAG_AVAR 'avar'
#define OT_TAG_CVAR 'cvar'
#define OT_TAG_FVAR 'fvar'
#define OT_TAG_GVAR 'gvar'
#define OT_TAG_HVAR 'HVAR'
#define OT_TAG_MVAR 'MVAR'
#define OT_TAG_STAT 'STAT'
#define OT_TAG_VVAR 'VVAR'

//Color Fonts
#define OT_TAG_COLR 'COLR'
#define OT_TAG_CPAL 'CPAL'

//Other OpenType Tables
#define OT_TAG_DSIG 'DSIG'
#define OT_TAG_LTSH 'LTSH'
#define OT_TAG_MERG 'MERG'
#define OT_TAG_PCLT 'PCLT'
#define OT_TAG_VDMX 'VDMX'
#define OT_TAG_FFTM 'FFTM'
#define OT_TAG_HDMX 'hdmx'
#define OT_TAG_KERN 'kern'
#define OT_TAG_META 'meta'
#define OT_TAG_VHEA 'vhea'
#define OT_TAG_VMTX 'vmtx'
#define OT_TAG_MORX 'morx'
#define OT_TAG_FEAT 'feat'

//--------------------------//




struct OpenType_OffTable
{
    u32 sfntVersion;
    u16 numTables;
    u16 searchRange;
    u16 entrySelector;
    u16 rangeShift;
};

//Tables have to be zero padded to always begin on 4-byte boundaries for the Rasterizer's ease
//The checksum algo assumes 32-bit aligned tables
//      So, ALL tables MUST be 32-bit aligned and zero padded.
struct OpenType_TableRecord
{
    //struct Tag { u8 T[4]; };
    
    u32 tableTag;
    u32 checkSum;
    u32 offset;  //From the start of the file.
    u32 length;
};

struct OpenType_SimpleGlyph
{
    s16 numberOfContours; //MUST BE >= 0 TO BE A SIMPLE GLYPH. OTHERWISE IT IS A COMPOSITE GLYPH!
    
    s16 xMin;
    s16 yMin;
    s16 xMax;
    s16 yMax;
    
    u16 *endPtsOfContours;
    
    u16 instructionLength; //If 0 there are NO instruction and the next member is skipped.
    u8  *instructions;
    
    u8 *flags; //TODO: NumberOfFlags MIA
    
    s16 *xCoordinates;
    s16 *yCoordinates; //And they could even be u8... WHO THE FUCK KNOWS!?
};

struct OpenType_DictData {
    u16 version;                  // 0
    u16 Notice;                   // 1
    u16 Copyright;                // 12 0
    u16 FullName;                 // 2
    u16 FamilyName;               // 3
    u16 Weight;                   // 4
    
    s32 isFixedPitch = FALSE;     // 12 1
    f64 ItalicAngle;              // 12 2 float
    s32 UnderlinePosition = -100; // 12 3
    s32 UnderlineThickness = 50;  // 12 4
    s32 PaintType;                // 12 5
    u32 CharstringType = 2;       // 12 6
    
    f64 *FontMatrix;              // 12 7 array
    u32 fontMatrixCount;
    
    s32 UniqueID;                 // 13
    s32 *FontBBox;                // 5    array
    u32 fontBBoxCount;
    
    s32 StrokeWidth;              // 12 8
    s32 *XUID;                    // 14   array
    u32 XUIDCount;
    
    s32 charset;                  // 15
    s32 encoding;                 // 16
    s32 CharStrings;              // 17
    s32 Private[2];               // 18 two numbers
    s32 SyntheticBase;            // 12 20
    
    u16 PostScript;               // 12 21
    u16 BaseFontName;             // 12 22
    s32 *BaseFontBlend;           // 12 23 delta
    u32 BaseFontBlendCount;
    
    //TODO: Missing CIDFont Operator Extension!!
    u32 FDArrayOff;               // 12 36
    u32 FDSelectOff;              // 12 37
    
    
    //NOTE: PRIVATE DICT
    s32 *BlueValues;              // 6     delta
    u32 BlueValuesCount;
    
    s32 *OtherBlues;              // 7     delta
    u32 OtherBluesCount;
    
    s32 *FamilyBlues;             // 8     delta
    u32 FamilyBluesCount;
    
    s32 *FamilyOtherBlues;        // 9     delta
    u32 FamilyOtherCount;
    
    f64 BlueScale = 0.039625L;    // 12 9  float
    s32 BlueShift = 7;            // 12 10
    s32 BlueFuzz = 1;             // 12 11
    
    s32 StdHW;                    // 10
    s32 StdVW;                    // 11
    
    s32 *StemSnapH;               // 12 12 delta
    u32 StemSnapHCount;
    s32 *StemSnapV;               // 12 13 delta
    u32 StemSnapVCount;
    
    b32 ForceBold = FALSE;        // 12 14 bool
    s32 LanguageGroup;            // 12 17
    f64 ExpansionFactor = 0.06L;  // 12 18
    s32 InitialRandomSeed;        // 12 19
    
    s32 Subrs;                    // 19
    
    s32 defaultWidthX;            // 20
    s32 nominalWidthX;            // 21
}; 

struct OpenType_CFF
{
    struct Index {
        u16 count; u32 *offsets; u8 *data;
        u32 dataLen;
    };
    
    struct Charset {
        struct Range1 { u16 first; u8  nLeft; };
        struct Range2 { u16 first; u16 nLeft; };
        
        u8 format;
        u16 *glyphs;  //FORMAT 0 SID Glyph Name Array 
        Range1 *rng1; //FORMAT 1 Lenght is obtain by preprocessing every glyph.
        Range2 *rng2; //FORMAT 2 Lenght is obtain by preprocessing every glyph.
    };
    
    struct Encoding {
        struct Range1 { u8 first; u8 nLeft; };
        struct Supplement { u8 code; u16 glyph; };
        u8 format;
        
        //FORMAT 0
        u8 nCodes;
        u8 *codes;
        
        //FORMAT 1
        u8 nRanges;
        Range1 *ranges;
        
        //SUPPLEMENT (if high-order bit in format is set)
        u8 nSups;
        Supplement *sups;
    };
    
    //Header
    u8 major;
    u8 minor;
    u8 hdrSize;
